Autodesk.Revit.DB.ExternalDefinition.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalDefinition.UserModifiable
Indicates whether the parameter can be modified by the user interface.
Remarks:
If true, the user can edit the value of this parameter. If false, the user cannot edit this value
(it will appear grayed out). However, any API application can modify the value of this parameter.
Since:
2015

Autodesk.Revit.DB.ExternalDefinition.Description
The description of the parameter. The description will be used as tooltip in the Revit UI including in the properties palette.
Since:
2015

Autodesk.Revit.DB.ExternalDefinition.OwnerGroup
Returns or change the group ID of the external parameter definition.
Remarks:  If failed When set the group, an InvalidOperationException will be thrown.

Autodesk.Revit.DB.ExternalDefinition.ParameterGroup
Returns the group ID of the parameter definition.

Autodesk.Revit.DB.ExternalDefinition.Visible
Indicates if the parameter is visible in the Autodesk Revit user interface.
Remarks: The visible property controls whether a shared parameter is hidden from the user. This
is useful if you wish to add data to an element that is only meaningful to your application and
not to the user. This value can only be set when the shared parameter definition is created.

Autodesk.Revit.DB.ExternalDefinition.ParameterType
Returns the user visible interpretation of the parameter data.
Remarks: The data within the parameter is stored in a very simple manner as an integer, double,
string or an element id, but to the user these values may be more meaningful as Length, Volume,
Mass etc. This parameter returns the interpretation that should be used for the data.

Autodesk.Revit.DB.ExternalDefinition.GUID
Returns the GUID associated with the shared parameter definition.
Remarks: Each shared parameter when created is issued a unique identifier. This identifier can then
be used at a later time to retrieve the parameter from the Element ensuring that the correct
parameter is always retrieved.

Autodesk.Revit.DB.ExternalDefinition.Name
The user visible name for the parameter.

Autodesk.Revit.DB.ExternalDefinition
The ExternalDefinition object adds properties specific to Autodesk Revit shared parameter definitions.
Remarks:
The ExternalDefinition object can be created by a definition Group object from a shared parameters file.
External parameter definition must belong to a Group which is nothing more than a collection of shared
parameter definitions. The following process should be followed to add a parameter to an
element: Open the shared parameters file, via the Application.OpenSharedParameterFile() method.
Access an existing or create a new group, via the DefinitionFile.Groups property. Access
an existing or create a new external parameter definition, via the
DefinitionGroup.Definitions property. Create a new Binding object with the categories to
which the parameter will be bound using an InstanceBinding or a TypeBinding object. Finally
add the binding and definition to the document using the Document.ParameterBindings object.